tap "homebrew/bundle"
tap "homebrew/services"
cask "anki"
cask "discord"
cask "eudic"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "jordanbaird-ice"
cask "kitty"
cask "raycast"
cask "stats"
cask "telegram"
cask "tencent-meeting"
cask "ticktick"
cask "visual-studio-code"
cask "wezterm"
cask "wireshark"
cask "zed"
mas "Drafts", id: 1435957248
mas "Instapaper Save", id: 1481302432
mas "Kindle Classic", id: 405399194
mas "Magnet", id: 441258766
mas "MarginNote 3", id: 1423522373
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "MoneyWiz", id: 1511185140
mas "QQ", id: 451108668
mas "TestFlight", id: 899247664
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
mas "喜马拉雅", id: 876336838
