tap "bufbuild/buf"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "joshmedeski/sesh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# GNOME XML library
brew "libxml2"
# Download with resuming and segmented downloading
brew "aria2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Statistics utility to count lines of code
brew "cloc"
# Tool for interacting with remote images and registries
brew "crane"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Remote terminal application
brew "mosh"
# Experimental optional static type checker for Python
brew "mypy"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Interactive grep tool
brew "percol"
# Manage compile and link flags for libraries
brew "pkg-config"
# Fast, disk space efficient package manager
brew "pnpm"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# View colored diff with side by side and auto pager support
brew "ydiff"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
