tap "bufbuild/buf"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Statistics utility to count lines of code
brew "cloc"
# Tool for interacting with remote images and registries
brew "crane"
# Core application library for C
brew "glib"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# GNU compiler collection
brew "gcc"
# GNOME XML library
brew "libxml2"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Render markdown on the CLI
brew "glow"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Remote terminal application
brew "mosh"
# Experimental optional static type checker for Python
brew "mypy"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage compile and link flags for libraries
brew "pkg-config"
# Fast, disk space efficient package manager
brew "pnpm"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# View colored diff with side by side and auto pager support
brew "ydiff"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
