tap "homebrew/bundle"
tap "homebrew/command-not-found"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way of working with Protocol Buffers
brew "buf"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Language Server for the Lua language
brew "lua-language-server"
# Remote terminal application
brew "mosh"
# Experimental optional static type checker for Python
brew "mypy"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
